

* TODO priv [2/11]
  - State "TODO"       from "TODO"       [2016-10-19 周三 09:00]
她喜欢我
还有时间
我能反杀
一直想飞到西安然后坐火车去敦煌

** TODO [#A] VICTORY LOVES PREPARATION
   DEADLINE: <2016-10-19 周三>
   CLOCK: [2016-10-19 周三 15:18]
   - State "TODO"       from ""           [2016-10-19 周三 10:33]
** TODO 下载六弄咖啡馆
   - State "TODO"       from "DONE"       [2016-10-19 周三 09:01]
   :PROPERTIES:
   :movie:    must download
   :END:
** TODO 我可以咬你一口吗
   - State "TODO"       from ""           [2016-10-20 周四 21:10]
** TODO 同步表情
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO LKM
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO PYTHON 那个模块
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
关键字 ddos 阿里养鸡 arm地址
** TODO irc channel 做中转
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO XJJ
   - State "TODO"       from ""           [2016-10-19 周三 15:19]
*** server
**** DONE C&C address release
     CLOSED: [2016-10-19 周三 15:21]
     - State "DONE"       from ""           [2016-10-19 周三 15:21]
     - curl http://my.csdn.net/echofocus | grep wassup
**** DONE C&C address bind and listen
     CLOSED: [2016-10-20 周四 13:35]
     - State "DONE"       from "TODO"       [2016-10-20 周四 13:35]
     - State "TODO"       from ""           [2016-10-19 周三 15:21]
     - C programming
**** DONE 执行 cd 之后无效 模仿一下 netcat 用 select
     CLOSED: [2016-10-20 周四 17:12]
     - State "DONE"       from "TODO"       [2016-10-20 周四 17:12]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]
*** client
**** DONE read C&C address
     CLOSED: [2016-10-19 周三 23:39]
     - State "DONE"       from "TODO"       [2016-10-19 周三 23:39]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]
**** DONE create channel
     CLOSED: [2016-10-20 周四 12:32]
     - State "DONE"       from "TODO"       [2016-10-20 周四 12:32]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]

**** DONE 整理 create channel 的代码
     CLOSED: [2016-10-20 周四 14:07]
     - State "DONE"       from "TODO"       [2016-10-20 周四 14:07]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]

*** TODO rootkit
    - State "TODO"       from ""           [2016-10-20 周四 17:12]
**** TODO 看感染的例子
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** TODO 例子运行起来
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** TODO 成功用 suterusu 感染
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** TODO 增加 suterusu 的功能 [0/3]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
     - [ ] run file after hide it
     - [ ] find port and pid and hide it
     - [ ] check status as daemon


** TODO 加密解密算法
   - State "TODO"       from ""           [2016-10-20 周四 18:
** DONE 转换添加 mid 到看代码的列表里
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]
** DONE 上传 tabbar-tweak.el
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]
   

* learn_table

| student | math | pyh | mean | pi number |
|---------+------+-----+------+-----------|
| b       |   13 |  09 |   11 |         5 |
| h       |   15 |  14 | 14.5 |         7 |
| a       |   17 |  13 |   15 |         9 |
#+TBLFM: $4=vmean($2..$3)
#+TBLFM: $5='(substring (number-to-string $pi) (round(string-to-number $4)) (+ 1 (round (string-to-number $4))));    
#+CONSTANTS: pi=3.1415926535897932384666666666666

| id |              r/g |              b/g |            gb/gr |   distance |
|----+------------------+------------------+------------------+------------|
|    | 540.602836879433 | 708.265957446809 | 1028.49290780142 |  1771.8880 |
|  1 |         0.560547 |         0.629883 |         1.000977 | 0.10865988 |
|  2 |         0.571289 |         0.642578 |         1.004883 | 0.10854316 |
|  7 |         0.574219 |         0.637695 |                1 | 0.11745107 |
#+TBLFM: $5=(((($2*1024/@2$2)-1)^2+(($3*1024/@2$3)-1)^2+(($4*1024/@2$4)-1)^2)^0.5)

* temporary [9/10]
  SCHEDULED: <2016-10-19 周三>
** DONE 同步.emacs
   CLOSED: [2016-10-19 周三 10:29]
   - State "DONE"       from "TODO"       [2016-10-19 周三 10:29]
   :PROPERTIES:
   :Effort:   0:00
   :END:
** DONE qyh_repo_rollback.sh [init|reset] [5/5]
 - [X] 列举相关的仓
   $w/kernel
   $w1
   $w1sdk
   $w2
 - [X] check arguments
 - [X] check $w
 - [X] reset 到 init
 - [X] sync 到 target
** DONE 擦白版
** DONE excel
 - [X] 计算公式（快捷键）
 - [X] 最大值
 - [X] 数据 -> 变化图
** DONE expand-region以及其他插件
** DONE 注释
** DONE 移动行
** DONE 问石梦云win7的主题
 - 搜狗的“图标整理器”
** DONE mtp驱动
